app/views/movies/index.html.erb

    <tr>
      <th><%= link_to("Movie Title", movies_path(:sort => 'title', :filtered => Hash[@ratings_to_show.map {|v| [v, 1]}]), :id => 'title_header', :class => @title_bg) %> </th>
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY "movies"."title" ASC