app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY "movies"."release_date" ASC
---
    def index
      @all_ratings = Movie.all_ratings
      @ratings_to_show = []
      if params[:ratings].nil? == false
        @ratings_to_show = params[:ratings].keys
      end



      @movies = Movie.with_ratings(@ratings_to_show)

      if params[:sort].nil? == false
        session[:sort] = params[:sort]
      end

      if params[:sort] == "title"
        @title_bg = "hilite bg-primary"
        @movies = @movies.order(:title)

      end
      if params[:sort] == "release"
        @rd_bg = "hilite bg-primary"
        @movies = @movies.order(:release_date)